shanghun1404/STM32F411_STerM/Main/Src/init.c
/*
 * init.c
 */

#include <stdio.h>
#include "init.h"
#include "sensor.h"
#include "custom_oled.h"
#include "custom_switch.h"
#include "custom_filesystem.h"
#include "stm32f4xx_ll_usart.h"
#include "Custom_UART_PuTTY.h"

/*
 * syscalls.c에 있는 _io_putchar 재정의
 */
int __io_putchar(int ch)
{
	while (!LL_USART_IsActiveFlag_TXE(USART2));
	LL_USART_TransmitData8(USART2, (char) ch);
	return ch;
}

void cali_menu1() {
	Custom_OLED_Printf("1");
	while (CUSTOM_SW_BOTH != Custom_Switch_Read());
}

typedef struct {
	char name[30];
	void (*func)();
} In_Menu;

typedef struct {
	char name[30];
	void (*func)();
} In_Setting;


void threshold_change() {
	uint8_t sw = 0;
	while ((sw = Custom_Switch_Read()) != CUSTOM_SW_BOTH) {
		if (sw == CUSTOM_SW_1) {
			th -= 0.01;
		}
		else if (sw == CUSTOM_SW_2) {
			th += 0.01;
		}

		Custom_OLED_Printf("th /1 %f /2 %f", th, 255*th);
	}
	Custom_OLED_Clear();
}



void check_delay() {
	Custom_OLED_Printf("a");
	Custom_Delay_ms(1000);
	Custom_OLED_Clear();
}
In_Menu in_menu[] = {
	{"Cali Menu 1", cali_menu1},
	{"Threshold Change", threshold_change},
	{"Check Delay", check_delay},
	{"Sensor Calib", Sensor_Calibration},
	{"Sensor Test Raw", Sensor_Test_Raw},
	{"Sensor Test Norm", Sensor_Test_Normalized},
	{"Sensor Test State", Sensor_Test_State},
	{"Position Test", position_test}
};

void Init() {
	/*
	 STM 보드와 컴퓨터 간 UART 통신을 통해 컴퓨터 터미널로 디버깅할 수 있도록 USART2를 활성화한다.
	 */
	LL_USART_Enable(USART2);
	FTDI_Begin(115200);

	/*
	 * PuTTY 터미널(USART2에 연결됨)에 "Hello ZETIN"을 출력한다.
	 * PuTTY_Printf는 starColor.c/starString.c(색상 팔레트, FindColor, xtoi 등)에 의존하며,
	 * 해당 구현 파일을 External Library/Src에 추가했으므로 정상 링크된다.
	 * "/g", "/b"는 각각 초록/파랑 색상 지정 코드다(starColor 규격). 줄 끝에서 색은 자동 복원된다.
	 */
	PuTTY_Printf("/gHello /bZETIN\n");

	/*
	 * 1ms 주기로 동작하는 SysTick을 기화한다. custom_delay.h 파일의 Custom_Delay_Get_SysTick
	 * 현재 SvsTick이 초기화된 시점부터 경과한 시간을 구할 수 있다.
	 */
	Custom_Delay_Init_SysTick();

	/*
	 * OLED를 사용하기 전에는 Custom_OLED_Init 함수를 호출하여 여러가지 초기화를 수행해야 한다.
	 * 이 함수는 OLED 처음 쓰기 전에 딱 한 번만 호출하면 된다.
	 */
	Custom_OLED_Init();

	/*
	 * 플래시를 사용하기 전에는 Custom_FileSystem_Load 함수를 호출하여 플래시 정보를 불러와야 한다.
	 * 이 함수는 플래시를 처음 쓰기 전에 딱 한 번만 호출하면 된다.
	 */
	Custom_FileSystem_Load();

	/**
	 * Custom_OLED_Printf 함수는 C언어에서 printf와 동일하게 동작한다.
	 * 즉, %d, %f 등의 서식 문자를 사용하여 숫자를 출력할 수 있다.
	 * 다만 특수한 기능들 추가되어있는데, /0이라는 부분이 있으면 첫 번째 줄의 첫 번째 칸으로 돌아가고,
	 * /1이라는 부분이 있으면 두 번째 줄의 첫 번째 칸으로 돌아간다.
	 * 그리고 /r, /g, /b라는 부분이 있으면 각각 문자를 빨강, 초록, 파랑으로 출력한다.
	 * 즉, 아래 예제에서는 첫 번째 줄에 "Hello"를 출력한 후, 두 번째 줄의 첫 번째 칸으로 커서가 이동하고 파란색 글씨로 "ZETIN!"을 쓴다.
	 */
	Custom_OLED_Init();
	Custom_OLED_Printf("/0Hello, /1/bZETIN!");
	Custom_Delay_ms(1000);

	/*
	 * 아래는 스위치를 사용하는 예제다.
	 * Custom_Switch_Read 함수 내부에는 1ms 딜레이가 존재하기 때문에, 이 함수를 주행 알고리즘 내부에 집어넣으면 성능이 크게 떨어지니 주의한.
	 */
	uint8_t sw = 0;
	int8_t count = 0;
	int num_of_menu = sizeof(in_menu) / sizeof(In_Menu);

	Custom_OLED_Clear();
	for (;;) {

		while (CUSTOM_SW_BOTH != (sw = Custom_Switch_Read())) {
			if (sw == CUSTOM_SW_1) {
				count--;
				Custom_OLED_Clear();
			}
			else if (sw == CUSTOM_SW_2) {
				count++;
				Custom_OLED_Clear();
			}
			count = (count + num_of_menu) % num_of_menu;
			Custom_OLED_Printf(" %s", in_menu[count].name);
		}
		Custom_OLED_Clear();

		in_menu[count].func();

		Custom_OLED_Clear();
		Custom_OLED_Printf("BYE!");
	}
}

